---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.FabricationPartLength
source: html/f4381866-68e0-6678-9ef7-f0d4f6bbb0f9.htm
---
# Autodesk.Revit.DB.ParameterTypeId.FabricationPartLength Property

"Length"

## Syntax (C#)
```csharp
public static ForgeTypeId FabricationPartLength { get; }
```